rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_LMEM.h
/*
** ###################################################################
**     Processor:           S32M24x
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32M24x RM Rev.4
**     Version:             rev. 1.5, 2024-08-01
**     Build:               b240801
**
**     Abstract:
**         Peripheral Access Layer for S32M24x
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32M24x_LMEM.h
 * @version 1.5
 * @date 2024-08-01
 * @brief Peripheral Access Layer for S32M24x_LMEM
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
 * The SoC header defines typedef for all modules.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
 * The SoC header defines macros for all modules and registers.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
 * These are generated macros used for accessing the bit-fields from registers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.1, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.2, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.4, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.5, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
 * This type qualifier is needed to ensure correct I/O access and addressing.
 */

/* Prevention from multiple including the same memory map */
#if !defined(S32M24x_LMEM_H_) /* Check if memory map has not been already included */
#define S32M24x_LMEM_H_

#include "S32M24x_COMMON.h"

/* ----------------------------------------------------------------------------
   -- LMEM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LMEM_Peripheral_Access_Layer LMEM Peripheral Access Layer
 * @{
 */

/** LMEM - Register Layout Typedef */
typedef struct {
    __IO uint32_t PCCCR;  /**< Cache control register, offset: 0x0 */
    __IO uint32_t PCCLCR; /**< Cache line control register, offset: 0x4 */
    __IO uint32_t PCCSAR; /**< Cache search address register, offset: 0x8 */
    __IO uint32_t PCCCVR; /**< Cache read/write value register, offset: 0xC */
    uint8_t RESERVED_0[16];
    __IO uint32_t PCCRMR; /**< Cache regions mode register, offset: 0x20 */
} LMEM_Type, *LMEM_MemMapPtr;

/** Number of instances of the LMEM module. */
#define LMEM_INSTANCE_COUNT (1u)

/* LMEM - Peripheral instance base addresses */
/** Peripheral LMEM base address */
#define IP_LMEM_BASE (0xE0082000u)
/** Peripheral LMEM base pointer */
#define IP_LMEM ((LMEM_Type*)IP_LMEM_BASE)
/** Array initializer of LMEM peripheral base addresses */
#define IP_LMEM_BASE_ADDRS                                                                         \
    {                                                                                              \
        IP_LMEM_BASE                                                                               \
    }
/** Array initializer of LMEM peripheral base pointers */
#define IP_LMEM_BASE_PTRS                                                                          \
    {                                                                                              \
        IP_LMEM                                                                                    \
    }

/* ----------------------------------------------------------------------------
   -- LMEM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LMEM_Register_Masks LMEM Register Masks
 * @{
 */

/*! @name PCCCR - Cache control register */
/*! @{ */

#define LMEM_PCCCR_ENCACHE_MASK (0x1U)
#define LMEM_PCCCR_ENCACHE_SHIFT (0U)
#define LMEM_PCCCR_ENCACHE_WIDTH (1U)
#define LMEM_PCCCR_ENCACHE(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_ENCACHE_SHIFT)) & LMEM_PCCCR_ENCACHE_MASK)

#define LMEM_PCCCR_PCCR2_MASK (0x4U)
#define LMEM_PCCCR_PCCR2_SHIFT (2U)
#define LMEM_PCCCR_PCCR2_WIDTH (1U)
#define LMEM_PCCCR_PCCR2(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_PCCR2_SHIFT)) & LMEM_PCCCR_PCCR2_MASK)

#define LMEM_PCCCR_PCCR3_MASK (0x8U)
#define LMEM_PCCCR_PCCR3_SHIFT (3U)
#define LMEM_PCCCR_PCCR3_WIDTH (1U)
#define LMEM_PCCCR_PCCR3(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_PCCR3_SHIFT)) & LMEM_PCCCR_PCCR3_MASK)

#define LMEM_PCCCR_INVW0_MASK (0x1000000U)
#define LMEM_PCCCR_INVW0_SHIFT (24U)
#define LMEM_PCCCR_INVW0_WIDTH (1U)
#define LMEM_PCCCR_INVW0(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_INVW0_SHIFT)) & LMEM_PCCCR_INVW0_MASK)

#define LMEM_PCCCR_PUSHW0_MASK (0x2000000U)
#define LMEM_PCCCR_PUSHW0_SHIFT (25U)
#define LMEM_PCCCR_PUSHW0_WIDTH (1U)
#define LMEM_PCCCR_PUSHW0(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_PUSHW0_SHIFT)) & LMEM_PCCCR_PUSHW0_MASK)

#define LMEM_PCCCR_INVW1_MASK (0x4000000U)
#define LMEM_PCCCR_INVW1_SHIFT (26U)
#define LMEM_PCCCR_INVW1_WIDTH (1U)
#define LMEM_PCCCR_INVW1(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_INVW1_SHIFT)) & LMEM_PCCCR_INVW1_MASK)

#define LMEM_PCCCR_PUSHW1_MASK (0x8000000U)
#define LMEM_PCCCR_PUSHW1_SHIFT (27U)
#define LMEM_PCCCR_PUSHW1_WIDTH (1U)
#define LMEM_PCCCR_PUSHW1(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_PUSHW1_SHIFT)) & LMEM_PCCCR_PUSHW1_MASK)

#define LMEM_PCCCR_GO_MASK (0x80000000U)
#define LMEM_PCCCR_GO_SHIFT (31U)
#define LMEM_PCCCR_GO_WIDTH (1U)
#define LMEM_PCCCR_GO(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_GO_SHIFT)) & LMEM_PCCCR_GO_MASK)
/*! @} */

/*! @name PCCLCR - Cache line control register */
/*! @{ */

#define LMEM_PCCLCR_LGO_MASK (0x1U)
#define LMEM_PCCLCR_LGO_SHIFT (0U)
#define LMEM_PCCLCR_LGO_WIDTH (1U)
#define LMEM_PCCLCR_LGO(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_LGO_SHIFT)) & LMEM_PCCLCR_LGO_MASK)

#define LMEM_PCCLCR_CACHEADDR_MASK (0x3FFCU)
#define LMEM_PCCLCR_CACHEADDR_SHIFT (2U)
#define LMEM_PCCLCR_CACHEADDR_WIDTH (12U)
#define LMEM_PCCLCR_CACHEADDR(x)                                                                   \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_CACHEADDR_SHIFT)) & LMEM_PCCLCR_CACHEADDR_MASK)

#define LMEM_PCCLCR_WSEL_MASK (0x4000U)
#define LMEM_PCCLCR_WSEL_SHIFT (14U)
#define LMEM_PCCLCR_WSEL_WIDTH (1U)
#define LMEM_PCCLCR_WSEL(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_WSEL_SHIFT)) & LMEM_PCCLCR_WSEL_MASK)

#define LMEM_PCCLCR_TDSEL_MASK (0x10000U)
#define LMEM_PCCLCR_TDSEL_SHIFT (16U)
#define LMEM_PCCLCR_TDSEL_WIDTH (1U)
#define LMEM_PCCLCR_TDSEL(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_TDSEL_SHIFT)) & LMEM_PCCLCR_TDSEL_MASK)

#define LMEM_PCCLCR_LCIVB_MASK (0x100000U)
#define LMEM_PCCLCR_LCIVB_SHIFT (20U)
#define LMEM_PCCLCR_LCIVB_WIDTH (1U)
#define LMEM_PCCLCR_LCIVB(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_LCIVB_SHIFT)) & LMEM_PCCLCR_LCIVB_MASK)

#define LMEM_PCCLCR_LCIMB_MASK (0x200000U)
#define LMEM_PCCLCR_LCIMB_SHIFT (21U)
#define LMEM_PCCLCR_LCIMB_WIDTH (1U)
#define LMEM_PCCLCR_LCIMB(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_LCIMB_SHIFT)) & LMEM_PCCLCR_LCIMB_MASK)

#define LMEM_PCCLCR_LCWAY_MASK (0x400000U)
#define LMEM_PCCLCR_LCWAY_SHIFT (22U)
#define LMEM_PCCLCR_LCWAY_WIDTH (1U)
#define LMEM_PCCLCR_LCWAY(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_LCWAY_SHIFT)) & LMEM_PCCLCR_LCWAY_MASK)

#define LMEM_PCCLCR_LCMD_MASK (0x3000000U)
#define LMEM_PCCLCR_LCMD_SHIFT (24U)
#define LMEM_PCCLCR_LCMD_WIDTH (2U)
#define LMEM_PCCLCR_LCMD(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_LCMD_SHIFT)) & LMEM_PCCLCR_LCMD_MASK)

#define LMEM_PCCLCR_LADSEL_MASK (0x4000000U)
#define LMEM_PCCLCR_LADSEL_SHIFT (26U)
#define LMEM_PCCLCR_LADSEL_WIDTH (1U)
#define LMEM_PCCLCR_LADSEL(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_LADSEL_SHIFT)) & LMEM_PCCLCR_LADSEL_MASK)

#define LMEM_PCCLCR_LACC_MASK (0x8000000U)
#define LMEM_PCCLCR_LACC_SHIFT (27U)
#define LMEM_PCCLCR_LACC_WIDTH (1U)
#define LMEM_PCCLCR_LACC(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_LACC_SHIFT)) & LMEM_PCCLCR_LACC_MASK)
/*! @} */

/*! @name PCCSAR - Cache search address register */
/*! @{ */

#define LMEM_PCCSAR_LGO_MASK (0x1U)
#define LMEM_PCCSAR_LGO_SHIFT (0U)
#define LMEM_PCCSAR_LGO_WIDTH (1U)
#define LMEM_PCCSAR_LGO(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCSAR_LGO_SHIFT)) & LMEM_PCCSAR_LGO_MASK)

#define LMEM_PCCSAR_PHYADDR_MASK (0xFFFFFFFCU)
#define LMEM_PCCSAR_PHYADDR_SHIFT (2U)
#define LMEM_PCCSAR_PHYADDR_WIDTH (30U)
#define LMEM_PCCSAR_PHYADDR(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCSAR_PHYADDR_SHIFT)) & LMEM_PCCSAR_PHYADDR_MASK)
/*! @} */

/*! @name PCCCVR - Cache read/write value register */
/*! @{ */

#define LMEM_PCCCVR_DATA_MASK (0xFFFFFFFFU)
#define LMEM_PCCCVR_DATA_SHIFT (0U)
#define LMEM_PCCCVR_DATA_WIDTH (32U)
#define LMEM_PCCCVR_DATA(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCVR_DATA_SHIFT)) & LMEM_PCCCVR_DATA_MASK)
/*! @} */

/*! @name PCCRMR - Cache regions mode register */
/*! @{ */

#define LMEM_PCCRMR_R15_MASK (0x3U)
#define LMEM_PCCRMR_R15_SHIFT (0U)
#define LMEM_PCCRMR_R15_WIDTH (2U)
#define LMEM_PCCRMR_R15(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R15_SHIFT)) & LMEM_PCCRMR_R15_MASK)

#define LMEM_PCCRMR_R14_MASK (0xCU)
#define LMEM_PCCRMR_R14_SHIFT (2U)
#define LMEM_PCCRMR_R14_WIDTH (2U)
#define LMEM_PCCRMR_R14(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R14_SHIFT)) & LMEM_PCCRMR_R14_MASK)

#define LMEM_PCCRMR_R13_MASK (0x30U)
#define LMEM_PCCRMR_R13_SHIFT (4U)
#define LMEM_PCCRMR_R13_WIDTH (2U)
#define LMEM_PCCRMR_R13(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R13_SHIFT)) & LMEM_PCCRMR_R13_MASK)

#define LMEM_PCCRMR_R12_MASK (0xC0U)
#define LMEM_PCCRMR_R12_SHIFT (6U)
#define LMEM_PCCRMR_R12_WIDTH (2U)
#define LMEM_PCCRMR_R12(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R12_SHIFT)) & LMEM_PCCRMR_R12_MASK)

#define LMEM_PCCRMR_R11_MASK (0x300U)
#define LMEM_PCCRMR_R11_SHIFT (8U)
#define LMEM_PCCRMR_R11_WIDTH (2U)
#define LMEM_PCCRMR_R11(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R11_SHIFT)) & LMEM_PCCRMR_R11_MASK)

#define LMEM_PCCRMR_R10_MASK (0xC00U)
#define LMEM_PCCRMR_R10_SHIFT (10U)
#define LMEM_PCCRMR_R10_WIDTH (2U)
#define LMEM_PCCRMR_R10(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R10_SHIFT)) & LMEM_PCCRMR_R10_MASK)

#define LMEM_PCCRMR_R9_MASK (0x3000U)
#define LMEM_PCCRMR_R9_SHIFT (12U)
#define LMEM_PCCRMR_R9_WIDTH (2U)
#define LMEM_PCCRMR_R9(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R9_SHIFT)) & LMEM_PCCRMR_R9_MASK)

#define LMEM_PCCRMR_R8_MASK (0xC000U)
#define LMEM_PCCRMR_R8_SHIFT (14U)
#define LMEM_PCCRMR_R8_WIDTH (2U)
#define LMEM_PCCRMR_R8(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R8_SHIFT)) & LMEM_PCCRMR_R8_MASK)

#define LMEM_PCCRMR_R7_MASK (0x30000U)
#define LMEM_PCCRMR_R7_SHIFT (16U)
#define LMEM_PCCRMR_R7_WIDTH (2U)
#define LMEM_PCCRMR_R7(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R7_SHIFT)) & LMEM_PCCRMR_R7_MASK)

#define LMEM_PCCRMR_R6_MASK (0xC0000U)
#define LMEM_PCCRMR_R6_SHIFT (18U)
#define LMEM_PCCRMR_R6_WIDTH (2U)
#define LMEM_PCCRMR_R6(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R6_SHIFT)) & LMEM_PCCRMR_R6_MASK)

#define LMEM_PCCRMR_R5_MASK (0x300000U)
#define LMEM_PCCRMR_R5_SHIFT (20U)
#define LMEM_PCCRMR_R5_WIDTH (2U)
#define LMEM_PCCRMR_R5(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R5_SHIFT)) & LMEM_PCCRMR_R5_MASK)

#define LMEM_PCCRMR_R4_MASK (0xC00000U)
#define LMEM_PCCRMR_R4_SHIFT (22U)
#define LMEM_PCCRMR_R4_WIDTH (2U)
#define LMEM_PCCRMR_R4(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R4_SHIFT)) & LMEM_PCCRMR_R4_MASK)

#define LMEM_PCCRMR_R3_MASK (0x3000000U)
#define LMEM_PCCRMR_R3_SHIFT (24U)
#define LMEM_PCCRMR_R3_WIDTH (2U)
#define LMEM_PCCRMR_R3(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R3_SHIFT)) & LMEM_PCCRMR_R3_MASK)

#define LMEM_PCCRMR_R2_MASK (0xC000000U)
#define LMEM_PCCRMR_R2_SHIFT (26U)
#define LMEM_PCCRMR_R2_WIDTH (2U)
#define LMEM_PCCRMR_R2(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R2_SHIFT)) & LMEM_PCCRMR_R2_MASK)

#define LMEM_PCCRMR_R1_MASK (0x30000000U)
#define LMEM_PCCRMR_R1_SHIFT (28U)
#define LMEM_PCCRMR_R1_WIDTH (2U)
#define LMEM_PCCRMR_R1(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R1_SHIFT)) & LMEM_PCCRMR_R1_MASK)

#define LMEM_PCCRMR_R0_MASK (0xC0000000U)
#define LMEM_PCCRMR_R0_SHIFT (30U)
#define LMEM_PCCRMR_R0_WIDTH (2U)
#define LMEM_PCCRMR_R0(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R0_SHIFT)) & LMEM_PCCRMR_R0_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group LMEM_Register_Masks */

/*!
 * @}
 */ /* end of group LMEM_Peripheral_Access_Layer */

#endif /* #if !defined(S32M24x_LMEM_H_) */
